
## Plan Result




<pre><code>Plan: 13 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES-PASS-v16
  * azurerm_key_vault_secret.POSTGRES-USER-v16
  * azurerm_key_vault_secret.POSTGRES_DATABASE-v16
  * azurerm_key_vault_secret.POSTGRES_HOST-v16
  * azurerm_key_vault_secret.POSTGRES_PORT-v16
  * module.db-professional-ref-data-v16.azurerm_postgresql_flexible_server.pgsql_server
  * module.db-professional-ref-data-v16.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.db-professional-ref-data-v16.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.db-professional-ref-data-v16.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.db-professional-ref-data-v16.azurerm_postgresql_flexible_server_database.pg_databases[&#34;dbrefdata&#34;]
  * module.db-professional-ref-data-v16.azurerm_resource_group.rg[0]
  * module.db-professional-ref-data-v16.null_resource.set-user-permissions-additionaldbs[&#34;dbrefdata&#34;]
  * module.db-professional-ref-data-v16.random_password.password
* Update
  * azurerm_resource_group.rg
  * module.db-professional-ref-data-v11.azurerm_template_deployment.postgres-paas


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS-v16 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS-v16" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat"
      + name                    = "professional-api-POSTGRES-PASS-v16"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER-v16 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER-v16" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat"
      + name                    = "professional-api-POSTGRES-USER-v16"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE-v16 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_DATABASE-v16" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat"
      + name                    = "professional-api-POSTGRES-DATABASE-v16"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST-v16 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_HOST-v16" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat"
      + name                    = "professional-api-POSTGRES-HOST-v16"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT-v16 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_PORT-v16" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat"
      + name                    = "professional-api-POSTGRES-PORT-v16"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-professional-api-aat"
        name     = "rd-professional-api-aat"
      ~ tags     = {
          - "Deployment Environment" = "aat"
          - "Team Name"              = "RD"
          - "lastUpdated"            = "2023-12-11T14:19:18Z"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.db-professional-ref-data-v11.azurerm_template_deployment.postgres-paas will be updated in-place
  ~ resource "azurerm_template_deployment" "postgres-paas" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-professional-api-postgres-db-v11-data-aat/providers/Microsoft.Resources/deployments/rd-professional-api-postgres-db-v11-aat"
        name                = "rd-professional-api-postgres-db-v11-aat"
      ~ parameters          = {
          ~ "skuCapacity"                = "4" -> "2"
          ~ "skuName"                    = "GP_Gen5_4" -> "GP_Gen5_2"
            # (16 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.db-professional-ref-data-v16.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "pgadmin"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgres-expanded"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "rd-professional-api-postgres-db-v16-aat"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "rd-professional-api-postgres-db-v16-data-aat"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + tags                          = {
          + "application"         = "reference-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/rd-professional-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ref-data-support"
          + "environment"         = "staging"
          + "managedBy"           = "Reference Data"
        }
      + version                       = "16"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.db-professional-ref-data-v16.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "rd-professional-api-postgres-db-v16-data-aat"
      + server_name         = "rd-professional-api-postgres-db-v16-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.db-professional-ref-data-v16.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + principal_name      = "jenkins-cftptl-intsvc-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "rd-professional-api-postgres-db-v16-data-aat"
      + server_name         = "rd-professional-api-postgres-db-v16-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.db-professional-ref-data-v16.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.db-professional-ref-data-v16.azurerm_postgresql_flexible_server_database.pg_databases["dbrefdata"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "dbrefdata"
      + server_id = (known after apply)
    }

  # module.db-professional-ref-data-v16.azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "rd-professional-api-postgres-db-v16-data-aat"
      + tags     = {
          + "application"         = "reference-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/rd-professional-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ref-data-support"
          + "environment"         = "staging"
          + "managedBy"           = "Reference Data"
        }
    }

  # module.db-professional-ref-data-v16.null_resource.set-user-permissions-additionaldbs["dbrefdata"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS CFT DB Access Reader"
          + "force_trigger"  = ""
          + "name"           = "rd-professional-api-postgres-db-v16"
          + "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        }
    }

  # module.db-professional-ref-data-v16.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 13 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1526,"Program":"tfcmt","SHA1":"","Vars":{}} -->